; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v3 ?v6)
             (pred_9 ?v10 ?v5)
             (pred_11 ?v3 ?v5)
             (pred_6 ?v9 ?v3 )
	     (pred_8 ?v3)
             (pred_4 ?v13)
             (pred_5 ?v10)
             (pred_3 ?v5)
             (pred_1 ?v3)
             (pred_7 ?v10)
             (pred_2 ?v3)
             (pred_12 ))



(:action op_4
:parameters (?v12 ?v8 ?v1 ?v11)
:precondition (and (pred_4 ?v12) (pred_4 ?v8) (pred_5 ?v1) (pred_3 ?v11)
          (pred_10 ?v12 ?v8) (pred_9 ?v1 ?v11)
                   (pred_11 ?v8 ?v11) (pred_8 ?v12) 
                   (pred_1 ?v8) (pred_7 ?v1))
:effect (and  (pred_2 ?v8) (not (pred_1 ?v8))))


(:action op_2
:parameters (?v12 ?v2)
:precondition (and (pred_4 ?v12) (pred_4 ?v2)
               (pred_8 ?v12) (pred_10 ?v12 ?v2) (pred_2 ?v2))
:effect (and (pred_8 ?v2) (not (pred_8 ?v12))))

(:action op_5
:parameters (?v12 ?v1)
:precondition (and (pred_4 ?v12) (pred_5 ?v1) 
                  (pred_8 ?v12) (pred_6 ?v1 ?v12) (pred_12 ))
:effect (and (pred_7 ?v1)
   (not (pred_6 ?v1 ?v12)) (not (pred_12 ))))


(:action op_1
:parameters (?v12 ?v4 ?v7)
:precondition (and (pred_4 ?v12) (pred_5 ?v4) (pred_5 ?v7)
                  (pred_8 ?v12) (pred_7 ?v7) (pred_6 ?v4 ?v12))
:effect (and (pred_7 ?v4) (pred_6 ?v7 ?v12)
        (not (pred_7 ?v7)) (not (pred_6 ?v4 ?v12))))

(:action op_3
:parameters (?v12 ?v1)
:precondition (and (pred_4 ?v12) (pred_5 ?v1) 
                  (pred_8 ?v12) (pred_7 ?v1))
:effect (and (pred_12 ) (pred_6 ?v1 ?v12) (not (pred_7 ?v1)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_06 obj_14 obj_11 obj_10 obj_12 obj_04 obj_07 obj_03 obj_16 obj_20 obj_19 obj_02 obj_17 obj_18 obj_08 obj_01
    obj_15 obj_05
    obj_13 obj_09
    )

    (:init
       (pred_12)

       (pred_4 obj_06)
       (pred_4 obj_14)
       (pred_4 obj_11)
       (pred_4 obj_10)
       (pred_4 obj_12)
       (pred_4 obj_04)
       (pred_4 obj_07)
       (pred_4 obj_03)
       (pred_4 obj_16)
       (pred_4 obj_20)
       (pred_4 obj_19)
       (pred_4 obj_02)
       (pred_4 obj_17)
       (pred_4 obj_18)
       (pred_4 obj_08)
       (pred_4 obj_01)
       (pred_3 obj_15)
       (pred_3 obj_05)
       (pred_5 obj_13)
       (pred_5 obj_09)

       (pred_10 obj_06 obj_12)
       (pred_10 obj_06 obj_14)
       (pred_10 obj_14 obj_04)
       (pred_10 obj_14 obj_11)
       (pred_10 obj_14 obj_06)
       (pred_10 obj_11 obj_07)
       (pred_10 obj_11 obj_10)
       (pred_10 obj_11 obj_14)
       (pred_10 obj_10 obj_03)
       (pred_10 obj_10 obj_11)
       (pred_10 obj_12 obj_16)
       (pred_10 obj_12 obj_04)
       (pred_10 obj_12 obj_06)
       (pred_10 obj_04 obj_20)
       (pred_10 obj_04 obj_07)
       (pred_10 obj_04 obj_14)
       (pred_10 obj_04 obj_12)
       (pred_10 obj_07 obj_19)
       (pred_10 obj_07 obj_03)
       (pred_10 obj_07 obj_11)
       (pred_10 obj_07 obj_04)
       (pred_10 obj_03 obj_02)
       (pred_10 obj_03 obj_10)
       (pred_10 obj_03 obj_07)
       (pred_10 obj_16 obj_17)
       (pred_10 obj_16 obj_20)
       (pred_10 obj_16 obj_12)
       (pred_10 obj_20 obj_18)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_20 obj_04)
       (pred_10 obj_20 obj_16)
       (pred_10 obj_19 obj_08)
       (pred_10 obj_19 obj_02)
       (pred_10 obj_19 obj_07)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_02 obj_01)
       (pred_10 obj_02 obj_03)
       (pred_10 obj_02 obj_19)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_17 obj_16)
       (pred_10 obj_18 obj_08)
       (pred_10 obj_18 obj_20)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_08 obj_01)
       (pred_10 obj_08 obj_19)
       (pred_10 obj_08 obj_18)
       (pred_10 obj_01 obj_02)
       (pred_10 obj_01 obj_08)
       (pred_1 obj_17)
       (pred_1 obj_16)
       (pred_11  obj_17 obj_15)
       (pred_11  obj_16 obj_05)
       (pred_2 obj_06)
       (pred_2 obj_14)
       (pred_2 obj_11)
       (pred_2 obj_10)
       (pred_2 obj_12)
       (pred_2 obj_04)
       (pred_2 obj_07)
       (pred_2 obj_03)
       (pred_2 obj_20)
       (pred_2 obj_19)
       (pred_2 obj_02)
       (pred_2 obj_18)
       (pred_2 obj_08)
       (pred_2 obj_01)

       (pred_9  obj_13 obj_15)
       (pred_9  obj_09 obj_05)
       (pred_6 obj_13 obj_01)
       (pred_6 obj_09 obj_01)
       (pred_8 obj_06)
    )

    (:goal (and
       (pred_6 obj_13 obj_19)
       (pred_6 obj_09 obj_11)
    ))
(:constraints
  (always (not (pred_8 obj_02)))
)
)

; plan
1. (op_2 obj_06 obj_14)
   deleted: (pred_8 obj_06)
   added: (pred_8 obj_14)
   goals met: 0 of 2
2. (op_2 obj_14 obj_11)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_11)
   goals met: 0 of 2
3. (op_2 obj_11 obj_07)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_07)
   goals met: 0 of 2
4. (op_2 obj_07 obj_19)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_19)
   goals met: 0 of 2
5. (op_2 obj_19 obj_08)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_08)
   goals met: 0 of 2
6. (op_2 obj_08 obj_01)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_01)
   goals met: 0 of 2
7. (op_5 obj_01 obj_13)
   deleted: (pred_6 obj_13 obj_01) (pred_12)
   added: (pred_7 obj_13)
   goals met: 0 of 2
8. (op_2 obj_01 obj_08)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_08)
   goals met: 0 of 2
9. (op_2 obj_08 obj_19)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_19)
   goals met: 0 of 2
10. (op_3 obj_19 obj_13)
   deleted: (pred_7 obj_13)
   added: (pred_12) (pred_6 obj_13 obj_19)
   goals met: 1 of 2
11. (op_2 obj_19 obj_08)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_08)
   goals met: 1 of 2
12. (op_2 obj_08 obj_01)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_01)
   goals met: 1 of 2
13. (op_5 obj_01 obj_09)
   deleted: (pred_6 obj_09 obj_01) (pred_12)
   added: (pred_7 obj_09)
   goals met: 1 of 2
14. (op_2 obj_01 obj_08)
   deleted: (pred_8 obj_01)
   added: (pred_8 obj_08)
   goals met: 1 of 2
15. (op_2 obj_08 obj_19)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_19)
   goals met: 1 of 2
16. (op_2 obj_19 obj_07)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_07)
   goals met: 1 of 2
17. (op_2 obj_07 obj_11)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_11)
   goals met: 1 of 2
18. (op_3 obj_11 obj_09)
   deleted: (pred_7 obj_09)
   added: (pred_12) (pred_6 obj_09 obj_11)
   goals met: 2 of 2
